#'안녕하세요'를 10번 출력

print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')
print('안녕하세요')

print('안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요','안녕하세요')


# 안녕하세요 저는 30살 홍길동입니다. 5번 출력해주세요.

print('안녕하세요 저는 30살 홍길동입니다.')
print('안녕하세요 저는 30살 홍길동입니다.')
print('안녕하세요 저는 30살 홍길동입니다.')
print('안녕하세요 저는 30살 홍길동입니다.')
print('안녕하세요 저는 30살 홍길동입니다.')

# 나이와 이름을 format을 이용해서 출력해보세요

print("안녕하세요 저는 {}살 {}입니다.".format(21, '연성묵')) #문자는 포맷 사용시 ''로 묶어야한다.