# 게시판 명령어 입력 : help

# add : 게시물 추가
# list : 게시물 목록 조회
# update : 게시물 수정

# 게시판 명령어 입력 : list
# ==========  게시물 목록  =========
# 번호 : 1    제목 : 소니의 축구교실
# 번호 : 2    제목 : 류뚱의 야구교실
# 번호 : 3    제목 : 길동의 도술교술
# ================================= 

# 게시판 명령어 입력 : update
# 수정할 게시물 번호를 입력 : 4
# 없는 게시물입니다.

# 게시판 명령어 입력 : update
# 수정할 게시물 번호를 입력 : 3
# 제목 : 제목3 
# 내용 : 내용3
# 수정이 완료되었습니다.
# ==========  게시물 목록  =========
# 번호 : 1    제목 : 소니의 축구교실
# 번호 : 2    제목 : 류뚱의 야구교실
# 번호 : 3    제목 : 제목3
# ================================= 

