#===================================
y, m, d = input().split('.')  #6019  
print(y, m, d, sep='-')

#===================================
f, h = input().split('-')     #6020
print(f, h, sep='')  # python에서 ,는 공백처리이다. 공백 없이 출력하려면
                     # sep=''안에 아무것도 넣지 않으면 공백 없이 출력된다.

#===================================                 
s = input()                   #6021
print(s[0])
print(s[1])
print(s[2])
print(s[3])
print(s[4])

#===================================
s = input()                   #6022
print(s[0;2], s[2:4], s[4:6])

#===================================
h, m, s = input().split(':')  #6023
print(m)

#===================================
w1, w2 = input().split()      #6024    
s = w1 + w2
print(s)

#===================================
num1, num2 = input()split()
num3 = int(num1) + int(num2)
print(num3)
