# 사칙 연산을 해보세요

# 120 더하기 300
# 172 빼기 50
# 312 곱하기 22
# 100 나누기 12 의 몫
# 100 나누기 12 몫의 정수 부분 
# 100 나누기 12 의 나머지
# 7의 제곱
print(120 + 300)
print(172 - 50)
print(312 * 22)
print(100 / 12)
print(100 // 12)
print(100 % 12)
print(7**2)

#========================================

# 복합 대입 연산자를 이용해서 풀어주세요.
# num의 값을 2증가시킨후
# 거기에 num의 값을 2로 나누고
# 거기에 10을 곱한 후
# 3으로 나눈 나머지를 구하세요.

num = 10
num += 2
num /= 2
num *= 10
num %= 3
print(num)

#===========================================

# 다음 명제를 비교연산자를 이용해 직접 표현해보고 print로 그 결과를 확인해보세요.

print(True) # 참
print(False) # 거짓

# 문제시작
a = 10

# a와 10이 같다.
print (a == 10)

# a와 10이 같지 않다.
print (a != 10)

# a가 10보다 크다.
print (a > 10)

# a가 10보다 크거나 같다.
print (a >= 10)

b = 10

# a와 b가 같다.
print(a == b)
# a와 b가 같지 않다.
print(a != b)
c = False

# c와 False가 같다.
print(c == False)

d = True

# c와 d가 같다.
print(c == d)

#====================================




